# HVACLoadType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HVACLoadType Properties
HVACLoadType Class See Also
---
The HVACLoadType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AirChangesPerHour | The air changes per hour. |
| AreaPerPerson | The area per person. |
| AssemblyInstanceId | The id of the assembly instance to which the element belongs.  (Inherited from Element.) |
| BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from Element.) |
| Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from Element.) |
| CoolingSetPoint | The cooling temperature set point in unit Kelvin (K). |
| CreatedPhaseId | Id of a Phase at which the Element was created.  (Inherited from Element.) |
| DehumidificationSetPoint | The dehumidification set point as a number between 0 and 1. |
| DemolishedPhaseId | Id of a Phase at which the Element was demolished.  (Inherited from Element.) |
| DesignOption | Returns the design option to which the element belongs. (Inherited from Element.) |
| Document | Returns the Document in which the Element resides. (Inherited from Element.) |
| Geometry | Retrieves the geometric representation of the element. (Inherited from Element.) |
| GroupId | The id of the group to which an element belongs.  (Inherited from Element.) |
| HeatingSetPoint | The heating temperature set point in unit Kelvin (K). |
| HumidificationSetPoint | The humidification set point as a number between 0 and 1. |
| Id | A unique identifier for an Element in an Autodesk Revit project.  (Inherited from Element.) |
| IsModifiable | Identifies if the element is modifiable.  (Inherited from Element.) |
| IsTransient | Indicates whether an element is transient or permanent.  (Inherited from Element.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Element.) |
| LatentHeatGainPerPerson | The latent heat gain per person. |
| LevelId | The id of the level associated with the element.  (Inherited from Element.) |
| LightingLoadDensity | The lighting load density. |
| Location | This property is used to find the physical location of an element within a project. (Inherited from Element.) |
| Name | A human readable name for the Element. (Inherited from Element.) |
| OutdoorAirFlowStandard | The outdoor airflow standard. |
| OutdoorAirPerArea | The outdoor air per area. |
| OutdoorAirPerPerson | The outdoor air per person. |
| OwnerViewId | The id of the view that owns the element.  (Inherited from Element.) |
| [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md "Parameter Property \(Guid\)") | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
| [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md "Parameter Property \(BuiltInParameter\)") | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
| [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md "Parameter Property \(Definition\)") | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |
| Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from Element.) |
| ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from Element.) |
| Pinned | Identifies if the element has been pinned to prevent changes.  (Inherited from Element.) |
| PlenumLighting | The percentage of plenum lighting contribution. |
| PowerLoadDensity | The power load density. |
| SensibleHeatGainPerPerson | The sensible heat gain per person. |
| UniqueId | A stable unique identifier for an element within the document.  (Inherited from Element.) |
| VersionGuid | Get the element version Guid.  (Inherited from Element.) |
| ViewSpecific | Identifies if the element is owned by a view.  (Inherited from Element.) |
| WorksetId | Get Id of the Workset which owns the element.  (Inherited from Element.) |

# See Also
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace